{
  "name": "Asadbek Khojimatov",
  "blockTitle": {
    "about": "About me",
    "tech": "Technologies",
    "skills": "Skills",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Get in touch"
  },
  "heroContent": "",
  "aboutContent": "I was born on August 29, 2001 (23 years old). I specialize in front-end development with ReactJS, modern UI frameworks, user-friendly experiences. My expertise extends into the Salesforce ecosystem, where I have worked extensively with Lightning Web Components (LWC), Apex, Visualforce, and REST API integrations to build scalable, business-driven solutions. Currently, I work at i2max, one of South Korea’s top Salesforce Platinum Partners, where I contribute to complex projects ranging from multimessenger integrations (Telegram, Line, WhatsApp, WeChat) to Experience Cloud portals for global brands like Hyundai, Kia, and Genesis. My work involves architecting dynamic user interfaces, integrating third-party tools, and optimizing system performance for enterprise clients.",
  "experiences": [
    {
      "year": "2022 - Present",
      "role": "Full-stack developer (Salesforce)",
      "company": "I2max South Korea",
      "description": "Responsibilities: Develop and customize Salesforce applications using Apex, Lightning Web Components (LWC -> Html, Css, Js), Visualforce and declarative tools. Create and optimize REST API integrations between Salesforce and external systems.",
      "technologies": [
        "Apex",
        "LWC",
        "Visualforce",
        "RestApi",
        "Javascript",
        "CSS",
        "Tailwind"
      ]
    }
  ],
  "projects": [
    {
      "title": "Telemax",
      "image": "telegram.png",
      "description": "Telegram bot channel and salesforce platform custom integration project. Involves: Custom object triggers, platform events, messenger application component to send and receive messages, customer registration form, case creation, reports and dashboards.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "RESTApi"
      ]
    },
    {
      "title": "Linemax",
      "image": "line.png",
      "description": "Line messenger channel and salesforce platform custom integration project. Involves: Custom object triggers, platform events, messenger application component to send and receive messages, customer registration form, case creation, reports and dashboards.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "RESTApi"
      ]
    },
    {
      "title": "i2max company corporate site",
      "image": "i2max.png",
      "description": "i2max.co.kr corporate company site of South Korean Salesforce platinum partner company. Site made in Experience cloud. Site involves dynamic data rendering, use of 3rd party tools, Login/Registration, training center.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience cloud",
        "RestAPI"
      ]
    },
    {
      "title": "HCA (Hyundai, Kia, Genesis) customer portal",
      "image": "hca.png",
      "description": "Hyunda, Kia and Genesis autralian customer portal. Made with Salesforce experience cloud. Has dynamic data rendering, usage of 3rd party tools, calculating systems, Payment system, Login/Registration.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience cloud",
        "RestAPI"
      ]
    },
    {
      "title": "I2OC multimessenger chat",
      "image": "omnichat.png",
      "description": "I2OC chat is the multimessenger salesforce application that allows to connect with multiple channels as Telegram, Line, Whatsapp and Wechat at once. Involves: Custom object triggers, platform events, messenger application component as well as custom component that allows to create connection and keep credentails.",
      "technologies": [
        "RestAPI",
        "Lightning web components",
        "HTML, CSS, JS",
        "TailwindCSS",
        "Visualforce",
        "Apex"
      ]
    },
    {
      "title": "Travel website for FlyTrip",
      "image": "fly-trip.png",
      "description": "Travel agency website made with Vite React JSX components and TailwindCSS",
      "technologies": ["HTML, CSS, JS", "ReactJS", "TailwindCSS"]
    }
  ],
  "contact": {
    "address": "767 Fifth Avenue, New York, NY 10153",
    "phoneNo": "+998 99 889 01 33",
    "email": "asadkhojimatov@gmail.com"
  }
}
