{
  "name": "Асадбек Ходжиматов",
  "blockTitle": {
    "about": "Обо мне",
    "tech": "Технологии",
    "skills": "Навыки",
    "experience": "Опыт",
    "projects": "Проекты",
    "contact": "Связаться со мной"
  },
  "heroContent": "",
  "aboutContent": "Я родился 29 августа 2001 года, (23 года). Я специализируюсь на фронтенд-разработке с использованием ReactJS и современных UI-фреймворков, удобных для пользователя интерфейсов. Мой опыт распространяется на экосистему Salesforce, где я много работал с интеграцией веб-компонентов Lightning (LWC), Apex, Visualforce и REST API для создания масштабируемых бизнес-решений. В настоящее время я работаю в i2max, одном из ведущих платиновых партнеров Salesforce в Южной Корее, где участвую в сложных проектах, начиная от интеграции нескольких мессенджеров (Telegram, Line, WhatsApp, WeChat) и заканчивая порталами Experience Cloud для таких мировых брендов, как Hyundai, Kia и Genesis. Моя работа включает в себя разработку динамических пользовательских интерфейсов, интеграцию сторонних инструментов и оптимизацию производительности системы для корпоративных клиентов.",
  "experiences": [
    {
      "year": "2022 - настоящее время",
      "role": "Full-stack разработчик (Salesforce)",
      "company": "I2max Южная Корея",
      "description": "Обязанности: Разработка и настройка Salesforce приложений с использованием Apex, Lightning Web Components (LWC -> Html, Css, Js), Visualforce и декларативных инструментов. Создание и оптимизация REST API интеграций между Salesforce и внешними системами.",
      "technologies": [
        "Apex",
        "LWC",
        "Visualforce",
        "RestApi",
        "Javascript",
        "CSS",
        "Tailwind"
      ]
    }
  ],
  "projects": [
    {
      "title": "Telemax",
      "image": "telegram.png",
      "description": "Проект интеграции бота Telegram с платформой Salesforce. Включает триггеры пользовательских объектов, платформенные события, компонент мессенджера для отправки и получения сообщений, форму регистрации клиентов, создание обращений, отчёты и панели мониторинга.",
      "technologies": [
        "Lightning Web Components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "REST API"
      ]
    },
    {
      "title": "Linemax",
      "image": "line.png",
      "description": "Проект интеграции мессенджера Line с платформой Salesforce. Включает триггеры пользовательских объектов, платформенные события, компонент мессенджера для отправки и получения сообщений, форму регистрации клиентов, создание обращений, отчёты и панели мониторинга.",
      "technologies": [
        "Lightning Web Components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "REST API"
      ]
    },
    {
      "title": "Корпоративный сайт компании i2max",
      "image": "i2max.png",
      "description": "Корпоративный сайт i2max.co.kr – южнокорейской компании, платинового партнера Salesforce. Сайт создан на платформе Experience Cloud. Включает динамическую загрузку данных, использование сторонних инструментов, систему входа/регистрации, учебный центр.",
      "technologies": [
        "Lightning Web Components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience Cloud",
        "REST API"
      ]
    },
    {
      "title": "Клиентский портал HCA (Hyundai, Kia, Genesis)",
      "image": "hca.png",
      "description": "Клиентский портал Hyundai, Kia и Genesis для австралийского рынка. Создан на платформе Salesforce Experience Cloud. Содержит динамическую загрузку данных, интеграцию сторонних инструментов, систему расчётов, платёжную систему, вход и регистрацию.",
      "technologies": [
        "Lightning Web Components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience Cloud",
        "REST API"
      ]
    },
    {
      "title": "Мультимессенджерный чат I2OC",
      "image": "omnichat.png",
      "description": "I2OC – это мультимессенджерное приложение Salesforce, которое позволяет одновременно подключаться к Telegram, Line, WhatsApp и WeChat. Включает триггеры пользовательских объектов, платформенные события, компонент мессенджера, а также кастомный компонент для создания подключений и хранения учётных данных.",
      "technologies": [
        "REST API",
        "Lightning Web Components",
        "HTML, CSS, JS",
        "TailwindCSS",
        "Visualforce",
        "Apex"
      ]
    },
    {
      "title": "Туристический сайт FlyTrip",
      "image": "fly-trip.png",
      "description": "Сайт туристического агентства, созданный с использованием Vite, React JSX компонентов и TailwindCSS.",
      "technologies": ["HTML, CSS, JS", "ReactJS", "TailwindCSS"]
    }
  ],
  "contact": {
    "address": "767 Пятая авеню, Нью-Йорк, NY 10153",
    "phoneNo": "+998 99 889 01 33",
    "email": "asadkhojimatov@gmail.com"
  }
}
