{
  "name": "Asadbek Khojimatov",
  "blockTitle": {
    "about": "Sobre mí",
    "tech": "Tecnologías",
    "skills": "Habilidades",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "heroContent": "",
  "aboutContent": "Nací el 29 de agosto de 2001 (23 años). Me especializo en desarrollo front-end con ReactJS, y frameworks UI modernos, experiencias fáciles de usar. Mi experiencia se extiende al ecosistema de Salesforce, donde he trabajado extensamente con integraciones de Lightning Web Components (LWC), Apex, Visualforce y REST API para crear soluciones escalables e impulsadas por el negocio. Actualmente trabajo en i2max, uno de los principales socios Platinum de Salesforce de Corea del Sur, donde contribuyo a proyectos complejos que van desde integraciones multimensajería (Telegram, Line, WhatsApp, WeChat) hasta portales Experience Cloud para marcas globales como Hyundai, Kia y Genesis. Mi trabajo implica diseñar interfaces de usuario dinámicas, integrar herramientas de terceros y optimizar el rendimiento del sistema para clientes empresariales.",
  "experiences": [
    {
      "year": "2022 - Presente",
      "role": "Desarrollador Full-stack (Salesforce)",
      "company": "I2max Corea del Sur",
      "description": "Responsabilidades: Desarrollar y personalizar aplicaciones en Salesforce utilizando Apex, Lightning Web Components (LWC -> Html, Css, Js), Visualforce y herramientas declarativas. Crear y optimizar integraciones REST API entre Salesforce y sistemas externos.",
      "technologies": [
        "Apex",
        "LWC",
        "Visualforce",
        "RestApi",
        "Javascript",
        "CSS",
        "Tailwind"
      ]
    }
  ],
  "projects": [
    {
      "title": "Telemax",
      "image": "telegram.png",
      "description": "Proyecto de integración personalizada del canal bot de Telegram y la plataforma Salesforce. Implica: Activadores de objetos personalizados, eventos de plataforma, componente de aplicación de mensajería para enviar y recibir mensajes, formulario de registro de clientes, creación de casos, informes y paneles.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "RESTApi"
      ]
    },
    {
      "title": "Linemax",
      "image": "line.png",
      "description": "Proyecto de integración personalizada del canal Line Messenger y la plataforma Salesforce. Implica: Activadores de objetos personalizados, eventos de plataforma, componente de aplicación de mensajería para enviar y recibir mensajes, formulario de registro de clientes, creación de casos, informes y paneles.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "RESTApi"
      ]
    },
    {
      "title": "Sitio corporativo de la empresa i2max.",
      "image": "i2max.png",
      "description": "i2max.co.kr sitio corporativo de la empresa socia platino de Salesforce de Corea del Sur. Sitio realizado en Experience Cloud. El sitio implica representación dinámica de datos, uso de herramientas de terceros, inicio de sesión/registro, centro de capacitación.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience cloud",
        "RestAPI"
      ]
    },
    {
      "title": "Portal del cliente HCA (Hyundai, Kia, Génesis)",
      "image": "hca.png",
      "description": "Portal de clientes australianos de Hyunda, Kia y Genesis. Realizado con la nube de experiencia de Salesforce. Tiene representación dinámica de datos, uso de herramientas de terceros, sistemas de cálculo, sistema de pago, inicio de sesión/registro.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience cloud",
        "RestAPI"
      ]
    },
    {
      "title": "Chat multimensajería I2OC",
      "image": "omnichat.png",
      "description": "I2OC chat es la aplicación Salesforce multimensajería que permite conectarse con múltiples canales como Telegram, Line, Whatsapp y Wechat a la vez. Implica: activadores de objetos personalizados, eventos de plataforma, componentes de aplicaciones de mensajería y componentes personalizados que permiten crear conexiones y mantener credenciales.",
      "technologies": [
        "RestAPI",
        "Lightning web components",
        "HTML, CSS, JS",
        "TailwindCSS",
        "Visualforce",
        "Apex"
      ]
    },
    {
      "title": "Sitio web de viajes para FlyTrip",
      "image": "fly-trip.png",
      "description": "Sitio web de agencia de viajes realizado con componentes Vite React JSX y TailwindCSS",
      "technologies": ["HTML, CSS, JS", "ReactJS", "TailwindCSS"]
    }
  ],
  "contact": {
    "address": "767 Quinta Avenida, Nueva York, NY 10153",
    "phoneNo": "+998 99 889 01 33",
    "email": "asadkhojimatov@gmail.com"
  }
}
