{
  "name": "Jorge Cortez",
  "blockTitle": {
    "about": "Sobre m칤",
    "tech": "Tecnolog칤as",
    "skills": "Habilidades",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "heroContent": "Soy Alejandro Herrera, un apasionado desarrollador Front-End que transforma ideas en experiencias visualmente atractivas, interactivas y f치ciles de usar. Con un gran amor por el dise침o limpio, los p칤xeles perfectos y la funcionalidad sin problemas, me especializo en la creaci칩n de aplicaciones web modernas que no solo se ven geniales, sino que tambi칠n son c칩modas de usar. 춰Creemos algo incre칤ble juntos! 游",
  "aboutContent": "Hola, soy Jorge Cortez, un desarrollador Front-End y de Salesforce apasionado por la creaci칩n de aplicaciones intuitivas, escalables y de alto rendimiento. Mi trayectoria en el desarrollo combina la creaci칩n de experiencias web modernas con un profundo conocimiento del ecosistema de Salesforce, fusionando lo mejor de ambos mundos. En el Front-End, me especializo en ReactJS, TypeScript y frameworks modernos para crear interfaces r치pidas, atractivas y f치ciles de usar.",
  "experiences": [
    {
      "year": "2022 - Presente",
      "role": "Desarrollador Full-stack (Salesforce)",
      "company": "I2max Corea del Sur",
      "description": "Responsabilidades: Desarrollar y personalizar aplicaciones en Salesforce utilizando Apex, Lightning Web Components (LWC -> Html, Css, Js), Visualforce y herramientas declarativas. Crear y optimizar integraciones REST API entre Salesforce y sistemas externos.",
      "technologies": [
        "Apex",
        "LWC",
        "Visualforce",
        "RestApi",
        "Javascript",
        "CSS",
        "Tailwind"
      ]
    }
  ],
  "projects": [
    {
      "title": "Telemax",
      "image": "telegram.png",
      "description": "Proyecto de integraci칩n personalizada del canal bot de Telegram y la plataforma Salesforce. Implica: Activadores de objetos personalizados, eventos de plataforma, componente de aplicaci칩n de mensajer칤a para enviar y recibir mensajes, formulario de registro de clientes, creaci칩n de casos, informes y paneles.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "RESTApi"
      ]
    },
    {
      "title": "Linemax",
      "image": "line.png",
      "description": "Proyecto de integraci칩n personalizada del canal Line Messenger y la plataforma Salesforce. Implica: Activadores de objetos personalizados, eventos de plataforma, componente de aplicaci칩n de mensajer칤a para enviar y recibir mensajes, formulario de registro de clientes, creaci칩n de casos, informes y paneles.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "RESTApi"
      ]
    },
    {
      "title": "Sitio corporativo de la empresa i2max.",
      "image": "i2max.png",
      "description": "i2max.co.kr sitio corporativo de la empresa socia platino de Salesforce de Corea del Sur. Sitio realizado en Experience Cloud. El sitio implica representaci칩n din치mica de datos, uso de herramientas de terceros, inicio de sesi칩n/registro, centro de capacitaci칩n.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience cloud",
        "RestAPI"
      ]
    },
    {
      "title": "Portal del cliente HCA (Hyundai, Kia, G칠nesis)",
      "image": "hca.png",
      "description": "Portal de clientes australianos de Hyunda, Kia y Genesis. Realizado con la nube de experiencia de Salesforce. Tiene representaci칩n din치mica de datos, uso de herramientas de terceros, sistemas de c치lculo, sistema de pago, inicio de sesi칩n/registro.",
      "technologies": [
        "Lightning web components",
        "HTML, CSS, JS",
        "Apex",
        "Visualforce",
        "Salesforce Experience cloud",
        "RestAPI"
      ]
    },
    {
      "title": "Chat multimensajer칤a I2OC",
      "image": "omnichat.png",
      "description": "I2OC chat es la aplicaci칩n Salesforce multimensajer칤a que permite conectarse con m칰ltiples canales como Telegram, Line, Whatsapp y Wechat a la vez. Implica: activadores de objetos personalizados, eventos de plataforma, componentes de aplicaciones de mensajer칤a y componentes personalizados que permiten crear conexiones y mantener credenciales.",
      "technologies": [
        "RestAPI",
        "Lightning web components",
        "HTML, CSS, JS",
        "TailwindCSS",
        "Visualforce",
        "Apex"
      ]
    },
    {
      "title": "Sitio web de viajes para FlyTrip",
      "image": "fly-trip.png",
      "description": "Sitio web de agencia de viajes realizado con componentes Vite React JSX y TailwindCSS",
      "technologies": ["HTML, CSS, JS", "ReactJS", "TailwindCSS"]
    }
  ],
  "contact": {
    "address": "767 Quinta Avenida, Nueva York, NY 10153",
    "phoneNo": "+998 99 889 01 33",
    "email": "asadkhojimatov@gmail.com"
  }
}
